src/Reports/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>ОстаткиТоваров</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/AccumulationRegisters/ОстатокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ОстатокТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Reports/ОстаткиТоваров/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
    РезультатТаблица = СформироватьОтчетНаСервере(ДатаОтчёта);
КонецПроцедуры


&НаСервере
Функция СформироватьОтчетНаСервере(ДатаОтчета)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Товары.Ссылка КАК Товар,
        |	Товары.Наименование КАК НаименованиеТовара,
        |	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК Количество
        |ИЗ
        |	Справочник.Товары КАК Товары
        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстатокТоваров.Остатки(&ДатаОтчета) КАК Остатки
        |		ПО Товары.Ссылка = Остатки.Товар
        |ГДЕ
        |	Товары.ЭтоГруппа = ЛОЖЬ
        |
        |УПОРЯДОЧИТЬ ПО
        |	НаименованиеТовара";
    
    Запрос.УстановитьПараметр("ДатаОтчета", ДатаОтчета);
    РезультатЗапроса = Запрос.Выполнить();
    
    
    // --- Рисуем таблицу ---
    ТабДок = Новый ТабличныйДокумент;
    ТабДок.Очистить();
    
    // Шапка
    ТабДок.Область("R1C1").Текст = "Товар";
    ТабДок.Область("R1C2").Текст = "Количество";
    
    Шапка = ТабДок.Область("R1C1:R1C2");
    Шапка.Шрифт = Новый Шрифт(,, 10, Истина);
    Шапка.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
    
    
    // Данные
    НомерСтроки = 1;
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        НомерСтроки = НомерСтроки + 1;
        
        ТабДок.Область("R" + НомерСтроки + "C1").Текст = Выборка.НаименованиеТовара;
        ТабДок.Область("R" + НомерСтроки + "C2").Текст = Формат(Выборка.Количество, "ЧДЦ=2");
        
        // Подсветка нулевых остатков
        Если Выборка.Количество = 0 Тогда
            СтрокаТаб = ТабДок.Область("R" + НомерСтроки + "C1:R" + НомерСтроки + "C2");
            СтрокаТаб.ЦветФона = WebЦвета.СветлоСерый;
            СтрокаТаб.ЦветТекста = WebЦвета.Серый;
        КонецЕсли;
        
    КонецЦикла;
    
    // Настройки внешнего вида
    ТабДок.ОтображатьЗаголовки = Ложь;
    ТабДок.ОтображатьСетку = Истина;
    ТабДок.АвтоМасштаб = Истина;
    
    // Ширина столбцов
    ТабДок.Область("C1").ШиринаКолонки = 30;
    ТабДок.Область("C2").ШиринаКолонки = 15;
    
    Возврат ТабДок;
    
КонецФункции
